"""Виконання завдань заліку передбачає створення застосунку мовою програмування Python.  
Застосунок повинен вирішувати задачу,  поставлену у завданні. 

Отриманий застосунок повинен бути опублікований у якості публічного проекту на рипозиторії (GitHub, GitLab, тощо). 
У якості відповіді на питання необхідно надати посилання на проект у репозиторії."""

"""
Дано текстовий файл. Файл вміщює резульати вимірювань 
у форматі HH:MM XXX , де HH:MM - час (H - години, M - хвилини), XXX - значення параменту (результат вимірювання). 
Користувач вводить певне значення AAA. Програма виводить всі значення часу, 
при яких результати вимірювання XXX перевищює введене користувачем значення AAA.
"""

"""f = open("text.txt", "r")
content = f.read().split("\n")

me_value = 0
while me_value <= 0 or me_value > 1000:
    me_value = int(input("Your result [1-1000] ---> "))
    if(me_value <= 0 or me_value > 1000): 
        print("\nWrong input, Right[1-1000]")

for line in content:
    parts = line.split(" ")
    if(int(parts[1]) > me_value):
        print(line)"""


"""
Дано текстовий файл. Файл вмішає довільний текст, 
текст розділений на абзаци (пустий рядок). 
Користувачем вводиться довільне слово. 

Необхідно створити застосунок, що виведе всі абзаци, 
які містять введене користувачем слово.
"""

"""
Дано текстовый файл, що вміщає довільний тест. 
Користувач вводить два слова, word1 та word2.

Необхідно розробити застосунок, що знайде у 
текстовому файлі всі появи word1 та замінить їх на word2.
"""

word1 = input("word 1 ---> ")
word2 = input("word 2 ---> ")

f = open("text.txt", "r")
content = f.read()
result = ""
content = content.replace(",", " ")
for word in content.split(" "):
    if(word == word1):
        result += word2 + " "
    else:
        result += word + " "
f = open("text.txt", "w")
f.write(result)

    